In [1]:
import pandas as pd

In [2]:
excel_content = pd.read_excel('CC-3Y-Transactions.xlsx', sheet_name='Credit-Card-Transactions')

In [3]:
excel_content['Year'] = pd.DatetimeIndex(excel_content['Date']).year

In [4]:
excel_2013 = excel_content[(excel_content['Year'] == 2013)]

In [5]:
grp2013 = excel_2013.groupby(['Year','City'],as_index=False)['Amount'].sum()

In [6]:
grp2013sorted = grp2013.sort_values(by='Amount',ascending=False).head(5)

In [7]:
grp2013sorted.set_index('Year', inplace=True)

In [8]:
excel_2014 = excel_content[(excel_content['Year'] == 2014)]

In [9]:
grp2014 = excel_2014.groupby(['Year','City'],as_index=False)['Amount'].sum()

In [10]:
grp2014sorted = grp2014.sort_values(by='Amount',ascending=False).head(5)

In [11]:
grp2014sorted.set_index('Year', inplace=True)

In [12]:
excel_2015 = excel_content[(excel_content['Year'] == 2015)]

In [13]:
grp2015 = excel_2015.groupby(['Year','City'],as_index=False)['Amount'].sum()

In [14]:
grp2015sorted = grp2015.sort_values(by='Amount',ascending=False).head(5)

In [15]:
grp2015sorted.set_index('Year', inplace=True)

In [16]:
grp2013sorted.T

Year,2013,2013,2013,2013,2013
City,"Bengaluru, India","Greater Mumbai, India","Ahmedabad, India","Delhi, India","Kanpur, India"
Amount,84999287,84735652,83291837,82126961,19640338

In [17]:
grp2014sorted.T

Year,2014,2014,2014,2014,2014
City,"Bengaluru, India","Greater Mumbai, India","Ahmedabad, India","Delhi, India","Hyderabad, India"
Amount,351482095,349709415,348289187,329591186,71066005

In [18]:
grp2015sorted.T

Year,2015,2015,2015,2015,2015
City,"Delhi, India","Greater Mumbai, India","Ahmedabad, India","Bengaluru, India","Kolkata, India"
Amount,145211065,142306409,136213286,135845357,30918731

In [19]:
excel_content['quarters'] = excel_content.Date.dt.quarter

In [20]:
group = excel_content.groupby(['Year','Gender','quarters'],as_index=False)['Amount'].sum()

In [21]:
group.pivot(index=['Year','Gender'], columns='quarters', values='Amount')

quarters               1            2            3            4
Year Gender
2013 F               NaN          NaN          NaN  333421908.0
     M               NaN          NaN          NaN  280221976.0
2014 F       318768288.0  331421060.0  335382914.0  334689993.0
     M       281336181.0  269947023.0  290613061.0  292555513.0
2015 F       344993188.0  206633679.0          NaN          NaN
     M       279678969.0  175169620.0          NaN          NaN

In [22]:
excel_2013smallest = excel_2013.groupby(['Year','Exp Type'],sort = True,as_index=False).sum().nsmallest(3,'Amount')

In [23]:
excel_2013smallest.set_index('Year', inplace=True)

In [24]:
excel_2014smallest = excel_2014.groupby(['Year','Exp Type'],sort = True,as_index=False).sum().nsmallest(3,'Amount')

In [25]:
excel_2014smallest.set_index('Year', inplace=True)

In [26]:
excel_2015smallest = excel_2015.groupby(['Year','Exp Type'],sort = True,as_index=False).sum().nsmallest(3,'Amount')

In [27]:
excel_2015smallest.set_index('Year', inplace=True)

In [28]:
excel_2013smallest.T

Year          2013       2013           2013
Exp Type    Travel    Grocery  Entertainment
Amount    15353606  111806890      113094669

In [29]:
excel_2014smallest.T

Year          2014       2014           2014
Exp Type    Travel    Grocery  Entertainment
Amount    65532848  428628961      443730570

In [30]:
excel_2015smallest.T

Year          2015           2015       2015
Exp Type    Travel  Entertainment    Grocery
Amount    28369157      169612297  177772072